#include <iostream>
//Переменная- именованный участок в оперативной памяти 
//Типы данных:
//1)	Целочисленные:
//-char, 1 байт , -128… 127
//-short, 2 байта, -32768…32767
//-int, 4 байта, -2^31… 2^31-1
//-long long, 8 байт, -2^63... 2^63-1
//-unsigned(без знаковые) int, 4 байта, 0…2^32-1
 //       2) Символьный:
 //-char, 1 байт , -128… 127
 //       3)Вещественные типы:
//	-float,4 байт,6-7 цифр(точность)
//	-double, 8 байт, 15-16 цифр
  //      4)Логический тип
	//-bool, 1байт, true/false
//Арифметические операции
//+,-,*,/,%
//Встроенные функции
//Pow, sqrt, sin , cos, tan, atan


int main()
{
    int a=666;
    int b=4;
    int c=a+b;
	std::cout <<c<< std::endl;
     
}
